bugs-api/app/controllers/users_controller.rb

INSERT INTO "users" ("lname", "fname", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["lname", "Hoffmann"], ["fname", "Jiri"], ["email", "hoffmaji@mail.gvsu.edu"], ["created_at", "2020-04-02 20:47:32.236923"], ["updated_at", "2020-04-02 20:47:32.236923"]]
---
  def create
    @user = User.create!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "users" SET "fname" = ?, "lname" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["fname", "Jiri"], ["lname", "Hoffmann"], ["email", "hoffmaji@mail.gvsu.edu"], ["updated_at", "2020-04-02 21:24:33.618787"], ["id", 25]]
---
  def update
    user = User.find(params[:id])
    user.update(user_params)